In [2]:
import numpy as np
import pandas as pd

In [1]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
#### creating a data frame

df1 = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [5]:
### operators - conditional selection- comparison operator
df1>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [7]:
booldf = df1>0

In [8]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [9]:
df1[booldf]   

#### note NaN whereever the condition is False 
#### to get values use bracket notation

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
#### another way of extracting values using bracket notation
df1[df1>0]

          W         X         Y         Z
A       NaN  0.223591  0.391835  0.347625
B  0.421956  1.995076       NaN  0.844907
C  0.858653       NaN  0.693666  1.169446
D       NaN       NaN       NaN       NaN
E       NaN       NaN       NaN  0.160551

In [10]:
#### to get a subset of values satisfying a particular condition
df1['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [11]:
#### using bracket notation, we can get only the rows where this cond is satisfied
df1[df1['W']>0] 

#### remember that the result just ignored the row with C as index. 
### Note that the row 'C' with "NaN" value was left out beecause W > 0 failed there

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df1

In [11]:
#### grab all the rows where Z< 0.6
df1[df1['Z'] < 0.6]

          W         X         Y         Z
A -0.928872  0.223591  0.391835  0.347625
D -0.837651 -2.212743 -1.107559 -1.167554
E -0.399959 -0.571907 -0.168170  0.160551

In [12]:
### assigning conditional operations on data frame to a variable
resultdf = df1[df1['W']>0] 

print('/n')
### print result set- which itself is a dataframe. meaning i can do other operations on this resultset
print(resultdf)

/n
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
##### extracting data from the above resultset - eg extract column X from result set
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [14]:
 #### alternate way to extract data from a result set of a conditional op on a data frame
df1[df1['W']>0] ['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [15]:
#### EXTRACTS MULTIPLE Columns from df1 after applying the condition 'W' > 0. 
#### note double bracket notation indicating multiple col extraction

df1[df1['W']>0]  [['X','Y']]  




####

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [21]:
#### EXTRACTS MULTIPLE Columns from df1 after applying the condition 'W' > 0. 

df1[df1['W']>0]  [['X','Y']]  

#### note double bracket notation indicating multiple col extraction

          X         Y
B  1.995076 -1.502742
C -1.095762  0.693666

In [ ]:
##### multiple conditions column extraction

In [16]:
(df1['W']>0) & (df1['Y']>1)

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [17]:
df1[(df1['W']>0) & (df1['Y']>1)]     #### & opeerator equivalent to and. using and will give an error

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df1[(df1['W']>0) | (df1['Y']>1)]     ##### | operator equivalent to or

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df1.reset_index()  #### resets index, but not inplace reset

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [ ]:
### df1.reset_index(inplace='True') will reset the index permanently

In [ ]:
#### adding a new column to data frame

In [20]:
### step1 - create a new list from a string 
newx = 'CA NY NJ OH CO'.split() 
newx

['CA', 'NY', 'NJ', 'OH', 'CO']

In [21]:
###step2 add a column to data frame df1 and call it States
df1['States'] = newx
df1

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     NJ
D  0.188695 -0.758872 -0.933237  0.955057     OH
E  0.190794  1.978757  2.605967  0.683509     CO

In [22]:
#### if we want to make the column States as Index

df1.set_index('States')

#### note the States has become index

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
NJ     -2.018168  0.740122  0.528813 -0.589001
OH      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [32]:
df1

          W         X         Y         Z States
A -0.928872  0.223591  0.391835  0.347625     CA
B  0.421956  1.995076 -1.502742  0.844907     NY
C  0.858653 -1.095762  0.693666  1.169446     NJ
D -0.837651 -2.212743 -1.107559 -1.167554     OH
E -0.399959 -0.571907 -0.168170  0.160551     CO

In [ ]:
df1

In [ ]:
#### difference between reset and set index is
#### reset index resets to new index and makes the old index as a column in the data frame
#### set index completely overrides the old index
### note both reset and set will become permanent ONLY when using INPLACE argument

In [23]:
#### EXTRACTS rows using conditions
resultdf_rows = df1.loc['A'] > 1
resultdf_rows

TypeError: '>' not supported between instances of 'str' and 'int'